
## Plan Result (sbox)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 2 to change, 3 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.POSTGRES_HOST
  * azurerm_key_vault_secret.app_insights_config
* Replace
  * module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases[&#34;toffee&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES_HOST will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
        id                      = "https://applesi-sbox.vault.azure.net/secrets/recipe-backend-POSTGRES-HOST/947342c1196946c69aa9538db3a14d1d"
        name                    = "recipe-backend-POSTGRES-HOST"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.app_insights_config will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_config" {
        id                      = "https://applesi-sbox.vault.azure.net/secrets/recipe-backend-app-insights-config/1adcd2bb5135428e8deffea32854b463"
        name                    = "recipe-backend-app-insights-config"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      - administrator_password_wo_version = 0 -> null
      ~ create_mode                       = "Update" -> "Default" # forces replacement
      ~ fqdn                              = "apple-v14-flexible-sbox.postgres.database.azure.com" -> (known after apply)
      ~ id                                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/apple-v14-flexible-data-sbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/apple-v14-flexible-sbox" -> (known after apply)
        name                              = "apple-v14-flexible-sbox"
      + storage_tier                      = (known after apply)
        tags                              = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/sds-toffee-recipes-service.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "managedBy"           = "Platform Operations"
            "startupMode"         = "onDemand"
        }
      - zone                              = "1" -> null
        # (14 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/apple-v14-flexible-data-sbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/apple-v14-flexible-sbox/configurations/backslash_quote" -> (known after apply)
        name      = "backslash_quote"
      ~ server_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/apple-v14-flexible-data-sbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/apple-v14-flexible-sbox" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases["toffee"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/apple-v14-flexible-data-sbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/apple-v14-flexible-sbox/databases/toffee" -> (known after apply)
        name      = "toffee"
      ~ server_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/apple-v14-flexible-data-sbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/apple-v14-flexible-sbox" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 2 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":628,"Program":"tfcmt","SHA1":"","Target":"sbox","Vars":{}} -->